#include "hardware.h"

//*************************************************************************
//                    系统时钟初始化
//*************************************************************************
void Clock_init()
{
  uchar i;
  BCSCTL1 &= ~XT2OFF;                 //打开XT振荡器
  BCSCTL2 |= SELM1 + SELS;              //MCLK为8MHZ，SMCLK为8MHZ
  do{
    IFG1 &= ~OFIFG;                   //清除震荡标志
    for(i=0; i < 100; i++)
       _NOP();                      //延时等待
  }
  while((IFG1&OFIFG) != 0);         //如果标志为1，则继续循环等待
  IFG1 &= ~OFIFG; 
}
//*************************************************************************
//              MSP430内部看门狗初始化
//*************************************************************************
void WDT_init()
{
   WDTCTL = WDTPW + WDTHOLD;       //关闭看门狗
}

//*************************************************************************
//			初始化IO口子程序
//*************************************************************************
void Port_init()
{
  P4SEL = 0x00;
  P4DIR = 0xFF;
  P5SEL = 0x00;
  P5DIR|= BIT0 + BIT1 + BIT5 + BIT6 + BIT7; 
}